# Function Structure2

## 🙋‍♂ CQS

 당신 코드의 독자들을 혼란스럽게 하지 말아라.


+ 값을 반환하는 함수는 상태를 변경하면 안된다.
+ 상태를 변경하는 함수는 exception을 발생시킬 수는 있지만, 값을 반환할 수는 없다.

## Tell Don't Ask
tell other object what to do, but not to ask object what the state is
매우 좋은 규칙이다. 이 규칙을 준수하다보면 Q가 많이 필요없어진다.

```java
o.getX().getY().getZ().doSomething()
```
tell, Dont ask를 명확히 위반한 코드이다. 뭔가를 tell하기전에 지속적으로 ask해야함.


```java
o.doSomething();
```
o에게 무엇을 하라고 했는데, o는 어떻게 해야할지 모른다. 하지만 o는 어떤 다른 객체에게 tell하면 되는지는 안다. 최종적으로 처리되기까지 요청이 전파된다.

## 📌 Law of Demeter
아래와 같은 객체들의 메서드만 호출할 수 있다.
+ 인자로 전달된 객체
+ localy 생성한 객체
+ 필드로 선언한 객체
+ 전역 객체

## ⚡️ Early returns
early return 이나 guarded return은 허용됨.
> 코드가 동작하도록하는 것 보다 이해할수 있게하는 것이 더 중요

``` java
private boolean nameIsValXxx
if(name.equals("")) return true;
if(wikiWordWidget.xxx) return true;
return false;
```

## ⚠️ Error handling
checked exception을 아예 사용하지 말아라. 만약사용해야한다면 두가지를 명심
+ 내가 명확하게 에러를 캐치해서 해야할것이 있다. 
+ 
🧱❓✅